Repository: nttzamos/dissertation
Catalog: resources/locale/*/LC_MESSAGES/dialogs.po
Languages: el

# EDIT_DATA_TEXT
source: Edit Students and Profiles
el: Διαχείριση Μαθητών και Προφίλ

# ADD_STUDENT_TEXT
source: Add Student
el: Προσθήκη Μαθητή

# EDIT_STUDENT_TEXT
source: Edit Student
el: Επεξεργασία Μαθητή

# ADD_PROFILE_TEXT
source: Add Profile
el: Προσθήκη Προφίλ

# EDIT_PROFILE_TEXT
source: Edit Profile
el: Επεξεργασία Προφίλ

# PROFILE_NAME_TEXT
source: Profile Name
el: Όνομα Προφίλ

# GRADE_SELECTION_TEXT
source: Grade Selection
el: Επιλογή Τάξης

# SUBJECT_SELECTION_TEXT
source: Subjects Selection
el: Επιλογή Μαθημάτων

# SAVE_PROFILE_BUTTON_TEXT
source: Save Profile
el: Αποθήκευση Προφίλ

# ERROR_SAVING_PROFILE_TEXT
source: Error saving profile
el: Αδυναμία αποθήκευσης προφίλ

# SUCCESS_SAVING_PROFILE_TEXT
source: The profile was saved successfully!
el: Το προφίλ που προσθέσατε αποθηκεύτηκε επιτυχώς!

# SELECT_ALL_SUBJECTS_TEXT
source: Select all subjects
el: Επιλογή όλων των μαθημάτων

# PROFILE_NAME_LENGTH_EXCEEDS_LIMIT_TEXT
source: The profile can not be saved because its name length exceeds the upper limit of 20 characters
el: Το προφίλ δεν μπορεί να αποθηκευτεί καθώς το μήκος του ονόματος του υπερβαίνει το όριο των 20 χαρακτήρων

# PROFILE_NAME_EXISTS_TEXT
source: The profile can not be saved because another profile with the same name already exists
el: Το προφίλ δεν μπορεί να αποθηκευτεί καθώς υπάρχει ήδη άλλο προφίλ με το ίδιο όνομα

# PROFILE_SELECTION_TEXT
source: Profile Selection
el: Επιλογή Προφίλ

# PROFILE_GRADE_TEXT
source: Profile Grade
el: Τάξη Προφίλ

# UPDATE_PROFILE_BUTTON_TEXT
source: Update Profile
el: Αποθήκευση Προφίλ

# DELETE_PROFILE_BUTTON_TEXT
source: Delete Profile
el: Διαγραφή Προφίλ

# ERROR_DELETING_PROFILE_TEXT
source: Error deleting profile
el: Αδυναμία διαγραφής προφίλ

# SELECT_PROFILE_TEXT
source: Select a profile...
el: Επιλέξτε ένα προφίλ...

# NO_PROFILES_TEXT
source: No profiles exist
el: Δεν υπάρχουν προφίλ

# MUST_SELECT_PROFILE_TEXT
source: You must select a profile
el: Πρέπει να επιλέξετε ένα προφίλ

# GRADE_PROFILE_UPDATE_ERROR_TEXT
source: The grade profiles can not be updated
el: Τα προφίλ των τάξεων δεν μπορούν να μεταβληθούν

# GRADE_PROFILE_DELETE_ERROR_TEXT
source: The grade profiles can not be deleted
el: Τα προφίλ των τάξεων δεν μπορούν να διαγραφούν

# STUDENT_NAME_TEXT
source: Student Name
el: Όνομα Μαθητή

# SAVE_STUDENT_BUTTON_TEXT
source: Save Student
el: Αποθήκευση Μαθητή

# ERROR_SAVING_STUDENT_TEXT
source: Error saving student
el: Αδυναμία αποθήκευσης μαθητή

# SUCCESS_SAVING_STUDENT_TEXT
source: The student was saved successfully!
el: Ο μαθητής που προσθέσατε αποθηκεύτηκε επιτυχώς!

# SELECT_ALL_PROFILES_TEXT
source: Select all profiles
el: Επιλογή όλων των προφίλ

# STUDENT_NAME_LENGTH_EXCEEDS_LIMIT_TEXT
source: The student can not be saved because its name length exceeds the upper limit of 20 characters
el: Ο μαθητής δεν μπορεί να αποθηκευτεί καθώς το μήκος του ονόματος του υπερβαίνει το όριο των 20 χαρακτήρων

# STUDENT_NAME_EXISTS_TEXT
source: The student can not be saved because another student with the same name already exists
el: Ο μαθητής δεν μπορεί να αποθηκευτεί καθώς υπάρχει ήδη άλλος μαθητής με το ίδιο όνομα

# STUDENT_SELECTION_TEXT
source: Student Selection
el: Επιλογή Μαθητή

# UPDATE_STUDENT_BUTTON_TEXT
source: Update Student
el: Αποθήκευση Μαθητή

# DELETE_STUDENT_BUTTON_TEXT
source: Delete Student
el: Διαγραφή Μαθητή

# SELECT_STUDENT_TEXT
source: Select a student...
el: Επιλέξτε έναν μαθητή...

# NO_STUDENTS_TEXT
source: No students exist
el: Δεν υπάρχουν μαθητές

# RESULT_EXPLANATION_DIALOG_TITLE
source: Results
el: Αποτελέσματα

# CLOSE_BUTTON_TEXT
source: Close
el: Κλείσιμο

# RESULT_EXPLANATION_TITLE
source: Results Explanation
el: Επεξήγηση Αποτελεσμάτων

# RESULT_EXPLANATION_TEXT
source: The related words that belong to a subject of the grade of the selected profile are displayed inside a black frame. Words that are returned by Wiktionary as related to the searched word, which do not belong to any subject of the selected profile's grade, are displayed inside a blue frame. On these frames, the button with the addition symbol is used to add the corresponding word to the vocabulary of the selected subjects.
el: Οι συγγενικές λέξεις που ανήκουν σε κάποιο βιβλίο της τάξης του επιλεγμένου προφίλ εμφανίζονται μέσα σε ένα μαύρο πλάισιο. Λέξεις τις οποίες επιστρέφει το Wiktionary ως συγγενικές, της λέξης που αναζητήθηκε μόλις, αλλά οι οποίες δεν υπάρχουν σε κάποιο βιβλίο της τάξης του επιλεγμένου προφίλ, παρουσιάζονται μέσα σε ένα μπλε πλαίσιο. Σε αυτές τις λέξεις, το κουμπί με το σύμβολο της πρόσθεσης έχει ως αποτέλεσμα την προσθήκη της εκάστοτε λέξης στο λεξιλόγιο των επιλεγμένων βιβλίων.

# APPLICATION_INTRODUCTION_TITLE
source: Introduction to Wordinary
el: Εισαγωγή στο Wordinary

# APPLICATION_INTRODUCTION_TEXT
source: Welcome to Wordinary! An application that helps elementary students learn the related words of the words that are contained in their school books. To use the application, you have to select a student, a profile of that student and one or all of the subjects of that profile. This application uses Wiktionary (https://el.wiktionary.org/) in order to find the related words of the words a user searches for. The search results are displayed in the bottom part of the application.
el: Καλώς ήρθατε στο Wordinary! Μια εφαρμογή που βοηθά μαθητές Δημοτικού να μάθουν ευκολότερα τις συγγενικές λέξεις των λέξεων που ανήκουν στα βιβλία τους. Για να χρησιμοποιήσετε την εφαρμογή, πρέπει να επιλέξετε έναν μαθητή, ένα προφίλ του συγκεκριμένου μαθητή και ένα ή όλα τα μαθήματα του συγκεκριμένου προφίλ. Η εφαρμογή χρησιμοποιεί το Wiktionary (https://el.wiktionary.org/) προκειμένου να εντοπίσει τις συγγενικές λέξεις των λέξεων που αναζητά ο χρήστης. Τα αποτελέσματα της αναζήτησης εμφανίζονται στο κάτω μέρος της εφαρμογής.

# STUDENT_EXPLANATION_TITLE
source: Students
el: Μαθητές

# STUDENT_EXPLANATION_TEXT
source: You can create students which correspond to your real students, in order to separate their data, that is their profiles, searches and starred words. You can create new students or edit the existing ones by pressing the "Edit Students and Profiles" button which is located in the upper right area of the application.
el: Μπορείτε να δημιουργήσετε μαθητές, οι οποίοι αντιστοιχούν ουσιαστικά στους πραγματικούς σας μαθητές, έτσι ώστε να διαφοροποιήσετε δεδομένα τους, όπως τα προφίλ τους, τις αναζητήσεις αλλά και τις αγαπημένες τους λέξεις. Μπορείτε να δημιουργήσετε νέους μαθητές ή να επεξεργαστείτε τους υπάρχοντες πατώντας το κουμπί "Διαχείριση Μαθητών και Προφίλ" που βρίσκεται στο δεξί μέρος της εφαρμογής.

# PROFILE_EXPLANATION_TITLE
source: Profiles
el: Προφίλ

# PROFILE_EXPLANATION_TEXT
source: Profiles belong to a specific grade and contain a set of its subjects. There are 6 default profiles (one for each grade of elementary school) that contain all of the subjects of the corresponding grade, which can not be edited or deleted. You can create new profiles or edit the existing ones by pressing the "Edit Students and Profiles" button which is located in the upper right area of the application.
el: Τα προφίλ ανήκουν σε μια συγκεκριμένη τάξη και περιέχουν ένα σύνολο των μαθημάτων αυτής της τάξης. Υπάρχουν 6 προκαθορισμένα προφίλ (ένα για κάθε τάξη του δημοτικού) που περιέχουν όλα τα μαθήματα της εκάστοτε τάξης, και τα οποία δεν μπορούν να μεταβληθούν ή να διαγραφούν. Μπορείτε να δημιουργήσετε νέα προφίλ ή να επεξεργαστείτε τα υπάρχοντα πατώντας το κουμπί "Διαχείριση Μαθητών και Προφίλ" που βρίσκεται στο δεξί μέρος της εφαρμογής.

# SUBJECT_EXPLANATION_TITLE
source: Subjects
el: Μαθήματα

# SUBJECT_EXPLANATION_TEXT
source: Each profile consists of multiple subjects. The subjects you select define the set of words from which you can search a word by using the search bar in the upper area of the application. As well as that, your recent searches and starred words depend on the selected subjects. Subject selection does not limit the results that will be displayed. The results are only limited from the grade to which the selected subject(s) belong. Essentially, subject selection does not limit the fact that search results will include words contained in other subjects of the same grade.
el: Κάθε προφίλ αποτελείται από πολλαπλά μαθήματα. Τα μάθηματα που επιλέγετε ορίζουν το σύνολο λέξεων από το οποίο μπορείτε να αναζητήσετε μια λέξη από την μπάρα αναζήτησης που βρίσκεται στο πάνω μέρος της εφαρμογής. Επίσης, οι πρόσφατες αναζητήσεις και οι αγαπημένες λέξεις αντιστοιχούν στα εκάστοτε επιλεγμένα μαθήματα. Η επιλογή μαθήματος δεν περιορίζει ωστόσο τα αποτελέσματα που θα εμφανιστούν. Τα αποτελέσματα περιορίζονται μόνο από την τάξη στην οποία ανήκει το επιλεγμένο μάθημα (ή μαθήματα). Δηλαδή, η επιλογή ενός συγκεκριμένου μαθήματος δεν περιορίζει το γεγονός, πως στα αποτελέσματα θα ανήκουν λέξεις από όλα τα μαθήματα της εκάστοτε τάξης του μαθήματος.

# RESULT_EXPLANATION_TUTORIAL_TITLE
source: Results
el: Αποτελέσματα

# RESULT_EXPLANATION_TUTORIAL_TEXT
source: Search results are displayed in the bottom part of the application. The related words that belong to a subject of the grade of the selected profile are displayed inside a black frame. Words that are returned by Wiktionary as related to the searched word, which do not belong to any subject of the selected profile's grade, are displayed inside a blue frame.
el: Τα αποτελέσματα της αναζήτησης του χρήστη εμφανίζονται στο κάτω μέρος της εφαρμογής. Οι συγγενικές λέξεις που ανήκουν σε κάποιο βιβλίο της τάξης του επιλεγμένου προφίλ εμφανίζονται μέσα σε ένα μαύρο πλάισιο. Λέξεις τις οποίες επιστρέφει το Wiktionary ως συγγενικές της λέξης που αναζητήθηκε μόλις, αλλά οι οποίες δεν υπάρχουν σε κάποιο βιβλίο της τάξης του επιλεγμένου προφίλ, παρουσιάζονται μέσα σε ένα μπλε πλαίσιο.

# VOCABULARY_EXPLANATION_TITLE
source: Vocabulary
el: Λεξιλόγιο

# VOCABULARY_EXPLANATION_TEXT
source: You can edit the vocabulary of the subjects of the elementary school grades by pressing the "Edit Words" button which is located in the upper right area of the application. You can add new words to any subject book you wish, edit existing words in case any typographical error exists or even remove some. Finally, you can edit the set of related words of a word by adding words to it or removing words from it.
el: Μπορείτε να επεξεργαστείτε το λεξιλόγιο των βιβλίων των τάξεων του Δημοτικού πατώντας το κουμπί "Διαχείριση Λεξιλογίου" που βρίσκεται στην πάνω δεξιά γωνία της εφαρμογής. Μπορείτε να προσθέσετε νέες λέξεις σε όποιο βιβλίο επιθυμείτε, να επεξεργαστείτε υπάρχουσες λέξεις σε περίπτωση που υπάρχει κάποιο τυπογραφικό λάθος ή ακόμα και να διαγράψετε λέξεις. Τέλος, μπορείτε να επεξεργαστείτε το σύνολο των συγγενικών τους λέξεων, προσθέτωντας ή αφαιρώντας λέξεις σε αυτό.

# TUTORIAL_DIALOG_TITLE
source: Tutorial
el: Οδηγίες

# CHECK_BOX_TEXT
source: Show tutorial on startup
el: Εμφανισή οδηγιών κατά την εκκίνηση

# PREVIOUS_BUTTON_TEXT
source: Previous
el: Προηγούμενο

# NEXT_BUTTON_TEXT
source: Next
el: Επόμενο

# WORD_TEXT
source: Word
el: Λέξη

# SAVE_WORD_BUTTON_TEXT
source: Save Word
el: Αποθήκευση λέξης

# ERROR_SAVING_WORD_TEXT
source: Error saving word
el: Αδυναμία αποθήκευσης λέξης

# SUCCESS_SAVING_WORD_TEXT
source: The word was saved successfully!
el: Η λέξη που προσθέσατε αποθηκεύτηκε επιτυχώς!

# WORD_EXISTS_TEXT
source: The word can not be saved because it already exists
el: Η λέξη δεν μπορεί να αποθηκευτεί καθώς υπάρχει ήδη

# ONLY_GREEK_CHARACTERS_ALLOWED_TEXT
source: Words must contain only greek lowercase letters
el: Η λέξη σας πρέπει να περιέχει μόνο ελληνικούς πεζούς χαρακτήρες

# WORD_LENGTH_EXCEEDS_LIMIT_TEXT
source: The word can not be saved because its length exceed the upper limit of 20 characters
el: Η λέξη δεν μπορεί να αποθηκευτεί καθώς το μήκος της υπερβαίνει το όριο των 20 χαρακτήρων

# WORD_SUBJECT_SELECTION_TEXT
source: Subject Selection (subjects in which the word will belong)
el: Επιλογή Μαθημάτων (μαθήματα στα οποία ανήκει η λέξη)

# WORD_SELECTION_TEXT
source: Word Selection
el: Επιλογή Λέξης

# UPDATE_WORD_BUTTON_TEXT
source: Update Word
el: Αποθήκευση Λέξης

# DELETE_WORD_BUTTON_TEXT
source: Delete Word
el: Διαγραφή Λέξης

# PLEASE_ENTER_WORD_TEXT
source: Please enter a word.
el: Παρακαλώ εισάγετε μια λέξη.

# PLEASE_ENTER_ANOTHER_WORD_TEXT
source: Please enter another word.
el: Παρακαλώ εισάγετε μια διαφορετική λέξη.

# WORD_MODIFICATION_TEXT
source: Word Modification
el: Τροποποίηση Λέξης

# FAMILY_SELECTION_TEXT
source: Edit related words
el: Επεξεργασία συγγενικών λέξεων

# FAMILY_SELECTION_TEXT_WITH_CHANGES
source: Edit related words (your changes have not been saved)
el: Επεξεργασία συγγενικών λέξεων (οι αλλαγές σας δεν έχουν αποθηκευτεί)

# SAVE_FAMILY_BUTTON_TEXT
source: Save related words
el: Αποθήκευση συγγενικών λέξεων

# SELECT_WORD_TO_BE_ADDED_TEXT
source: Select a word to be added to the related words
el: Επιλέξτε μια λέξη που θα προστεθεί στις συγγενικές λέξεις

# REMOVE_SELECTED_WORDS_TEXT
source: Remove selected words
el: Αφαίρεση επιλεγμένων λέξεων

# FAMILY_WORDS_APPEAR_HERE_TEXT
source: The related words of the words you search for appear here
el: Εδώ εμφανίζονται οι συγγενικές λέξεις των λέξεων που αναζητείτε

# NO_FAMILY_WORDS_TEXT
source: The word you searched for does not have any related words in the grade subjects
el: Η επιλεγμένη λέξη δεν έχει συγγενικές λέξεις στα βιβλία της τάξης

# EDIT_WORDS_TEXT
source: Edit Words
el: Διαχείριση Λεξιλογίου

# ADD_WORD_TEXT
source: Add Word
el: Προσθήκη Λέξης

# EDIT_WORD_TEXT
source: Edit Word
el: Επεξεργασία Λέξης

# EDIT_FAMILY_TEXT
source: Edit Related Words
el: Επεξεργασία Συγγενικών Λέξεων

# REDUNDANT_PROFILE_MESSAGE
source: The profile can not be saved because its subjects coincide with these of the default (grade) profile
el: Το προφίλ δεν μπορεί να αποθηκευτεί καθώς τα μαθήματα του ταυτίζονται με αυτά του προκαθορισμένου προφίλ

# HIDE_MESSAGE_CHECKBOX
source: Do not show again until the application closes
el: Να μην εμφανιστεί ξανά, μέχρι να κλείσει η εφαρμογή

# DELETE_PROFILE_PERMISSION
source: Are you sure that you wish to delete the selected profile? Students data for this specific profile will be erased.In addition, students that have only this profile will be left with no profiles.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε το επιλεγμένο προφίλ; Τα δεδομένα των μαθητών για το προφίλ αυτό θα διαγραφούν. Επίσης, μαθητές που έχουν μόνο το συγκεκριμένο προφίλ θα μείνουν χωρίς προφίλ.

source: Yes
el: Ναι

source: Cancel
el: Ακύρωση

# DELETE_STUDENT_PERMISSION
source: Are you sure that you wish to delete the selected student? All of her data will be erased.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε τον επιλεγμένο μαθητή; Όλα τα δεδομένα του μαθητή θα διαγραφούν.

# DELETE_WORD_PERMISSION
source: Are you sure that you wish to delete the selected word? All of its data for the selected grade will be erased.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε την επιλεγμένη λέξη; Όλα τα δεδομένα της λέξης για την επιλεγμένη τάξη θα διαγραφούν.
