Repository: nttzamos/dissertation
Catalog: resources/locale/*/LC_MESSAGES/menu.po
Languages: el

# SETTINGS_TEXT
source: Settings
el: Ρυθμίσεις

# TUTORIAL_TEXT
source: Tutorial
el: Οδηγίες

# MINIMIZE_APPLICATION_TEXT
source: Minimize application
el: Ελαχιστοποίηση εφαρμογής

# EXIT_APPLICATION_TEXT
source: Exit application
el: Κλείσιμο εφαρμογής

# TITLE_TEXT
source: Settings
el: Ρυθμίσεις

# RESULTS_TEXT
source: Number of Resutls
el: Αριθμός Αποτελεσμάτων

# MAXIMUM_RESULTS_TEXT
source: Maximum number of results
el: Μέγιστος αριθμός αποτελεσμάτων

# GENERAL_SETTINGS_TEXT
source: General Settings
el: Γενικές Ρυθμίσεις

# REMEMBER_LAST_STUDENT_TEXT
source: Remember last student picked
el: Αυτόματη επιλογή του τελευταίου μαθητή

# SHOW_EDIT_WORDS_BUTTON_TEXT
source: Show edit words button
el: Εμφάνιση επιλογής επεξεργασίας λέξεων

# ONLY_SHOW_WORDS_WITH_FAMILY_TEXT
source: Only show words with related words
el: Εμφάνιση μόνο λέξεων με συγγενικές λέξεις

# THEME_SELECTION_TEXT
source: Theme Selection
el: Επιλογή Θέματος

# LANGUAGE_SELECTION_TEXT
source: Language Selection
el: Επιλογή γλώσσας

# LIGHT_THEME_TEXT
source: Light
el: Ανοιχτό

# DARK_THEME_TEXT
source: Dark
el: Σκοτεινό

# RESTORE_DATABASE_TITLE
source: Restore Database
el: Επαναφορά Δεδομένων

# RESTORE_DATABASE_BUTTON
source: Restore default data
el: Διαγραφή δεδομένων χρήστη

# SHOW_TUTORIAL_TEXT
source: Show tutorial on startup
el: Εμφανισή οδηγιών κατά την εκκίνηση

# WIKTIONARY_USAGE
source: Use Wiktionary (internet connection needed)
el: Χρήση Wiktionary (απαιτείται σύνδεση στο διαδίκτυο)

source: Yes
el: Ναι

source: No
el: Όχι

source: Cancel
el: Ακύρωση

# HIDE_MESSAGE_CHECKBOX
source: Do not show again until the application closes
el: Να μην εμφανιστεί ξανά, μέχρι να κλείσει η εφαρμογή

# THEME_UPDATE_TITLE
source: Theme Update
el: Ανανέωση Θέματος

# THEME_UPDATE_TEXT
source: The theme will be updated once the application is restarted
el: Η αλλαγή του θέματος θα εφαρμοστεί όταν γίνει επανεκκίνηση της εφαρμογής

# LANGUAGE_UPDATE_TITLE
source: Language Update
el: Ανανέωση γλώσσας

# LANGUAGE_UPDATE_TEXT
source: The application language will be updated once the application is restarted
el: Η αλλαγή της γλώσσας θα εφαρμοστεί όταν γίνει επανεκκίνηση της εφαρμογής

# RESTORE_DATABASE_TEXT
source: Are you sure that you wish to restore the database to its default state? All of your application data will be erased.
el: Είστε σίγουροι ότι θέλετε να επαναφέρετε την βάση δεδομένων στην αρχική της κατάσταση; Όλα τα δεδομένα σας θα διαγραφούν.

# UNSAVED_CHANGES_MESSAGE_VISIBILITY
source: Show warning when I have edited a word, a student or a profile but I have not saved my changes.
el: Εμφάνιση μηνύματος προειδοποίησης όταν έχω επεξεργαστεί λέξη, μαθητή ή προφίλ αλλά δεν έχω αποθηκεύσει τις αλλαγές μου.
