Repository: nttzamos/dissertation
Catalog: resources/locale/*/LC_MESSAGES/search.po
Languages: el

# SEARCH_TEXT
source: Search
el: Αναζήτηση

# CLEAR_SEARCH_TEXT
source: Clear Search
el: Καθαρισμός αναζήτησης

# UNINITIALIZED_STATE_TEXT
source: You have to select a subject first.
el: Πρέπει να επιλέξετε κάποιο μάθημα πρώτα.

# PLEASE_ENTER_WORD_TEXT
source: Please enter a word.
el: Παρακαλώ εισάγετε μια λέξη.

# EDIT_WORDS_BUTTON_TEXT
source: Edit Words
el: Επεξεργασία Λέξεων

# EDIT_WORDS_TOOLTIP_TEXT
source: You can edit the words of each grade, as well as their relative words
el: Μπορείτε να επεξεργαστείτε τις λέξεις κάθε τάξης, καθώς και τις συγγενικές τους λέξεις

# ENTER_WORD_TEXT
source: You have to enter a word.
el: Πρέπει να αναζητήσετε μια λέξη.

# EDIT_DATA_BUTTON_TEXT
source: Edit Student and Profiles
el: Επεξεργασία Μαθητών και Προφίλ

# EDIT_DATA_TOOLTIP_TEXT
source: You can create/edit students, as well as their profiles.
el: Μπορείτε να δημιουργήσετε/επεξεργαστείτε μαθητές, καθώς και τα προφίλ τους.

# SELECT_STUDENT_TEXT
source: Please select a student...
el: Επιλέξτε έναν μαθητή...

# NO_STUDENTS_TEXT
source: There are no students
el: Δεν υπάρχουν μαθητές

# MUST_SELECT_STUDENT_TEXT
source: You have to select a student.
el: Πρέπει να επιλέξετε μαθητή.

# MUST_SELECT_STUDENT_AND_PROFILE_TEXT
source: You have to select a student and a profile.
el: Πρέπει να επιλέξετε μαθητή και προφίλ.

# MUST_SELECT_PROFILE_TEXT
source: You have to select a profile.
el: Πρέπει να επιλέξετε προφίλ.

# STUDENT_NO_PROFILES_TEXT
source: There are no profiles.
el: Ο μαθητής δεν έχει προφίλ.

# SELECT_PROFILE_TEXT
source: Please select a profile...
el: Επιλέξτε ένα προφίλ...

# SELECT_SUBJECT_TEXT
source: Please select a subject...
el: Επιλέξτε ένα μάθημα...

# ALL_SUBJECTS_TEXT
source: All subjects
el: Όλα τα μαθήματα
